tutorials/basic/scalarTransportDBSFoam/4StraightFractures/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls 
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
   outlet 
    {
        type            zeroGradient;
    }

   frontAndBack
   {
           type empty;
   }

}


// ************************************************************************* //
