tutorials/basic/scalarTransportDBSFoam/4StraightFractures/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.0001;

lx0 0;
ly0 0;
lz0 0;

lx 500;
ly 500;
lz 5;



vertices        
(
    ($lx0    $ly0    $lz0)
    ($lx     $ly0    $lz0)
    ($lx     $ly     $lz0)
    ($lx0    $ly     $lz0)
    ($lx0    $ly0    $lz)
    ($lx     $ly0    $lz)
    ($lx     $ly     $lz)
    ($lx0    $ly     $lz)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)  (250 250 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    outlet 
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    inlet 
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    walls 
    {
        type patch;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
	);
    }
    frontAndBack
    {
	type empty;
	faces
	(
            (0 3 2 1)
            (4 5 6 7)
        );
    }

);


// ************************************************************************* //
