tutorials/basic/scalarTransportDBSFoam/4StraightFractures/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .0500;

y1 0;
y2 .0500;

z1 0;
z2 .0005;

velocity volumeAveraged;
pressureDrop velocityWeightedAverageGradient;
